ArduPilot/ardupilot/libraries/AP_HAL_ChibiOS/hwdef/STM32CubeConf/F427-24MHz/F427-24MHz.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F4
PC3.Mode=Full_Duplex_Master
ProjectManager.MainLocation=Src
PA6.Mode=Full_Duplex_Master
USART2.IPParameters=VirtualMode
RCC.CortexFreq_Value=168000000
SPI3.Direction=SPI_DIRECTION_2LINES
SPI4.VirtualType=VM_MASTER
SPI3.VirtualType=VM_MASTER
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F427VITx
SPI1.VirtualType=VM_MASTER
SPI2.VirtualType=VM_MASTER
PB10.Mode=I2C
UART8.IPParameters=VirtualMode
SH.ADCx_IN2.0=ADC1_IN2,IN2
RCC.PLLCLKFreq_Value=168000000
PC12.Signal=SDIO_CK
PC10.Signal=SDIO_D2
RCC.PLLQCLKFreq_Value=48000000
SPI4.Direction=SPI_DIRECTION_2LINES
ProjectManager.functionlistsort=
PA11.Mode=Device_Only
RCC.RTCFreq_Value=32000
PA0/WKUP.Signal=UART4_TX
USART1.IPParameters=VirtualMode
PB11.Signal=I2C2_SDA
PB13.Signal=CAN2_TX
PD9.Mode=Asynchronous
PinOutPanel.RotationAngle=0
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
RCC.SAI_BClocksFreq_Value=12250000
Mcu.IP4=I2C2
Mcu.IP5=NVIC
RCC.FCLKCortexFreq_Value=168000000
Mcu.IP2=CAN2
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP3=I2C1
Mcu.IP0=ADC1
Mcu.IP1=CAN1
PA12.Signal=USB_OTG_FS_DP
Mcu.UserConstants=
SPI4.Mode=SPI_MODE_MASTER
Mcu.ThirdPartyNb=0
SPI1.Direction=SPI_DIRECTION_2LINES
PH0/OSC_IN.Mode=HSE-External-Oscillator
RCC.HCLKFreq_Value=168000000
SH.ADCx_IN3.0=ADC1_IN3,IN3
PE2.Mode=Full_Duplex_Master
Mcu.IPNb=21
RCC.I2SClocksFreq_Value=96000000
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=168000000
PB6.Signal=I2C1_SCL
RCC.VcooutputI2S=96000000
PC7.Signal=USART6_RX
PH1/OSC_OUT.Signal=RCC_OSC_OUT
SH.ADCx_IN3.ConfNb=1
PB6.Mode=I2C
SPI1.CalculateBaudRate=42.0 MBits/s
PC3.Signal=SPI2_MOSI
Mcu.Pin6=PC3
PD0.Signal=CAN1_RX
Mcu.Pin7=PA0/WKUP
PD8.Signal=USART3_TX
Mcu.Pin8=PA1
PE5.Signal=SPI4_MISO
Mcu.Pin9=PA2
RCC.VCOSAIOutputFreq_Value=49000000
SPI4.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler
PE1.Signal=UART8_TX
RCC.AHBFreq_Value=168000000
SPI2.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_2
Mcu.Pin0=PE2
PD5.Mode=Asynchronous
Mcu.Pin1=PE5
GPIO.groupedBy=
Mcu.Pin2=PE6
Mcu.Pin3=PH0/OSC_IN
Mcu.Pin4=PH1/OSC_OUT
Mcu.Pin5=PC2
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_2
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=24000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB3.Mode=Full_Duplex_Master
Mcu.IP10=SPI3
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Mcu.IP12=SYS
Mcu.IP11=SPI4
Mcu.IP18=USART3
ProjectManager.FirmwarePackage=STM32Cube FW_F4 V1.25.0
Mcu.IP17=USART2
MxDb.Version=DB.5.0.60
Mcu.IP19=USART6
Mcu.IP14=UART7
PB4.Mode=Full_Duplex_Master
Mcu.IP13=UART4
Mcu.IP16=USART1
ProjectManager.BackupPrevious=false
Mcu.IP15=UART8
RCC.VCOInputFreq_Value=1000000
PB5.Mode=Full_Duplex_Master
File.Version=6
PC9.Mode=SD_4_bits_Wide_bus
SPI2.CalculateBaudRate=21.0 MBits/s
PE2.Signal=SPI4_SCK
PB7.Signal=I2C1_SDA
PA8.Signal=RCC_MCO_1
Mcu.IP20=USB_OTG_FS
SH.ADCx_IN4.ConfNb=1
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PD3.Mode=Full_Duplex_Master
PH1/OSC_OUT.Mode=HSE-External-Oscillator
SPI4.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_2
ProjectManager.HalAssertFull=false
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_3CYCLES
ProjectManager.ProjectName=F427-24MHz
RCC.MCO2PinFreq_Value=168000000
Mcu.Package=LQFP100
PA6.Signal=SPI1_MISO
PB12.Mode=Slave
SPI2.Mode=SPI_MODE_MASTER
CAN2.BS1=CAN_BS1_1TQ
CAN2.BS2=CAN_BS2_1TQ
SPI3.Mode=SPI_MODE_MASTER
USART2.VirtualMode=VM_ASYNC
USART6.VirtualMode=VM_ASYNC
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
USART3.IPParameters=VirtualMode
PA10.Signal=USART1_RX
USB_OTG_FS.VirtualMode=Device_Only
PC11.Mode=SD_4_bits_Wide_bus
RCC.APB2CLKDivider=RCC_HCLK_DIV2
RCC.APB1TimFreq_Value=84000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
SPI3.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler
SPI2.Direction=SPI_DIRECTION_2LINES
USB_OTG_FS.IPParameters=VirtualMode
PB13.Mode=Slave
PE7.Signal=UART7_RX
PD6.Signal=USART2_RX
SPI1.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_2
ProjectManager.CustomerFirmwarePackage=
RCC.SAI_AClocksFreq_Value=12250000
PB4.Signal=SPI3_MISO
PA3.Signal=ADCx_IN3
CAN1.CalculateTimeQuantum=380.95238095238096
PA5.Mode=Full_Duplex_Master
ProjectManager.ProjectFileName=F427-24MHz.ioc
ADC1.Rank-0\#ChannelRegularConversion=1
PA7.Mode=Full_Duplex_Master
UART4.IPParameters=VirtualMode
PA10.Mode=Asynchronous
Mcu.PinsNb=49
ProjectManager.NoMain=false
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,master,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,NbrOfConversionFlag
USART6.IPParameters=VirtualMode
PC11.Signal=SDIO_D3
CAN1.IPParameters=CalculateTimeQuantum,BS1,BS2
PD3.Signal=SPI2_SCK
PE1.Mode=Asynchronous
CAN2.IPParameters=CalculateTimeQuantum,BS1,BS2
PC8.Signal=SDIO_D0
PC2.Signal=SPI2_MISO
PC6.Signal=USART6_TX
PC10.Mode=SD_4_bits_Wide_bus
PD1.Signal=CAN1_TX
ProjectManager.DefaultFWLocation=true
PC2.Mode=Full_Duplex_Master
RCC.VCOSAIOutputFreq_ValueQ=12250000
PD9.Signal=USART3_RX
PD5.Signal=USART2_TX
ProjectManager.DeletePrevious=true
UART7.VirtualMode=Asynchronous
RCC.APB1CLKDivider=RCC_HCLK_DIV4
UART4.VirtualMode=Asynchronous
UART8.VirtualMode=Asynchronous
PD6.Mode=Asynchronous
RCC.FamilyName=M
PE8.Mode=Asynchronous
PA9.Mode=Asynchronous
CAN1.BS2=CAN_BS2_1TQ
PB11.Mode=I2C
CAN1.BS1=CAN_BS1_1TQ
ProjectManager.TargetToolchain=EWARM V8.32
PC6.Mode=Asynchronous
PA9.Signal=USART1_TX
RCC.VcooutputI2SQ=96000000
SPI2.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler
RCC.LSE_VALUE=32768
PD8.Mode=Asynchronous
PA1.Signal=UART4_RX
Mcu.Pin48=VP_SYS_VS_Systick
Mcu.Pin46=PE0
Mcu.Pin47=PE1
PA0/WKUP.Mode=Asynchronous
PB10.Signal=I2C2_SCL
RCC.VCOI2SOutputFreq_Value=192000000
PD2.Mode=SD_4_bits_Wide_bus
Mcu.Pin40=PD6
PA5.Signal=SPI1_SCK
Mcu.Pin41=PB3
Mcu.Pin44=PB6
PC12.Mode=SD_4_bits_Wide_bus
Mcu.Pin45=PB7
Mcu.Pin42=PB4
board=custom
Mcu.Pin43=PB5
RCC.VCOOutputFreq_Value=336000000
ProjectManager.LastFirmware=true
PD1.Mode=Master
PH0/OSC_IN.Signal=RCC_OSC_IN
RCC.APB2Freq_Value=84000000
PA1.Mode=Asynchronous
SPI3.CalculateBaudRate=21.0 MBits/s
PE6.Mode=Full_Duplex_Master
MxCube.Version=5.6.1
Mcu.Pin37=PD2
Mcu.Pin38=PD3
Mcu.Pin35=PD0
PE8.Signal=UART7_TX
Mcu.Pin36=PD1
SPI1.Mode=SPI_MODE_MASTER
Mcu.Pin39=PD5
PE5.Mode=Full_Duplex_Master
SH.ADCx_IN2.ConfNb=1
Mcu.Pin30=PA11
SPI3.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_2
VP_SYS_VS_Systick.Mode=SysTick
RCC.EthernetFreq_Value=168000000
CAN2.CalculateTimeQuantum=380.95238095238096
Mcu.Pin33=PC11
Mcu.Pin34=PC12
Mcu.Pin31=PA12
SH.ADCx_IN4.0=ADC1_IN4,IN4
Mcu.Pin32=PC10
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
SPI4.CalculateBaudRate=42.0 MBits/s
PE6.Signal=SPI4_MOSI
ProjectManager.FreePins=false
RCC.IPParameters=48MHZClocksFreq_Value,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CortexFreq_Value,EthernetFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI_VALUE,I2SClocksFreq_Value,LSE_VALUE,LSI_VALUE,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLM,PLLN,PLLQ,PLLQCLKFreq_Value,RTCFreq_Value,RTCHSEDivFreq_Value,SAI_AClocksFreq_Value,SAI_BClocksFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIOutputFreq_Value,VCOSAIOutputFreq_ValueQ,VcooutputI2S,VcooutputI2SQ
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F427V(G-I)Tx
PE0.Signal=UART8_RX
PD0.Mode=Master
Mcu.Pin26=PC9
Mcu.Pin27=PA8
RCC.RTCHSEDivFreq_Value=12000000
PA2.Signal=ADCx_IN2
Mcu.Pin24=PC7
ProjectManager.UnderRoot=false
Mcu.Pin25=PC8
Mcu.IP8=SPI1
Mcu.IP9=SPI2
Mcu.Pin28=PA9
Mcu.IP6=RCC
PC8.Mode=SD_4_bits_Wide_bus
Mcu.Pin29=PA10
Mcu.IP7=SDIO
ProjectManager.CoupleFile=false
RCC.48MHZClocksFreq_Value=48000000
PB3.Signal=SPI3_SCK
PA4.Signal=ADCx_IN4
RCC.SYSCLKFreq_VALUE=168000000
PE7.Mode=Asynchronous
Mcu.Pin22=PD9
PB5.Signal=SPI3_MOSI
Mcu.Pin23=PC6
Mcu.Pin20=PB13
ADC1.master=1
Mcu.Pin21=PD8
PA12.Mode=Device_Only
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
USART3.VirtualMode=VM_ASYNC
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
USART1.VirtualMode=VM_ASYNC
ProjectManager.CompilerOptimize=6
PB7.Mode=I2C
PA11.Signal=USB_OTG_FS_DM
ProjectManager.HeapSize=0x200
Mcu.Pin15=PE7
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PE8
Mcu.Pin13=PA6
UART7.IPParameters=VirtualMode
Mcu.Pin14=PA7
Mcu.Pin19=PB12
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PB10
RCC.HSI_VALUE=16000000
Mcu.Pin18=PB11
RCC.PLLQ=7
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
ADC1.NbrOfConversionFlag=1
Mcu.Pin11=PA4
Mcu.Pin12=PA5
RCC.PLLM=24
RCC.PLLN=336
Mcu.Pin10=PA3
PA8.Mode=Clock-out-1
PC9.Signal=SDIO_D1
PC7.Mode=Asynchronous
PD2.Signal=SDIO_CMD
RCC.APB1Freq_Value=42000000
ProjectManager.DeviceId=STM32F427VITx
PB12.Signal=CAN2_RX
PE0.Mode=Asynchronous
ProjectManager.LibraryCopy=0
PA7.Signal=SPI1_MOSI
